# pandas library

In [1]:
import pandas
pandas.__version__

'1.3.4'

In [2]:
import pandas as pd
import numpy as np

# Introducing Pandas Objects

pandas data structures: Series, DataFrame and Index

1) pandas series object

A pandas series is one-dimensional array of indexed data. It can be created from a list or array as follows

#pd.series(data,index=index)

In [3]:
data=pd.Series([10,20,30,40,50])
data

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
type(data)

pandas.core.series.Series

In [5]:
data.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
data[0]

10

In [8]:
data[1:3]

1    20
2    30
dtype: int64

In [9]:
data=pd.Series([0.25,0.5,0.75,1],index=["a",'b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [10]:
data['a']

0.25

In [11]:
#we can use noncontiguous or nonsequential indices
data=pd.Series([0.25,0.5,0.75,1],index=[1,2,5,9])
data

1    0.25
2    0.50
5    0.75
9    1.00
dtype: float64

In [12]:
data[9]

1.0

Series as specialized dictionary

In [13]:
bts={"jin":30,'suga':29,'jhope':28,'rm':28,'jimin':27,'v':27,'jk':25}
bts

{'jin': 30, 'suga': 29, 'jhope': 28, 'rm': 28, 'jimin': 27, 'v': 27, 'jk': 25}

In [14]:
bts=pd.Series(bts)
bts

jin      30
suga     29
jhope    28
rm       28
jimin    27
v        27
jk       25
dtype: int64

In [15]:
type(bts)

pandas.core.series.Series

In [16]:
bts['jin']

30

In [17]:
bts['jimin':'v']

jimin    27
v        27
dtype: int64

In [18]:
pd.Series(5,index=[100,500,1000])

100     5
500     5
1000    5
dtype: int64

In [19]:
pd.Series({2:"a",3:"b",8:"c"}) # data can be a dictionary, in which index defaults to the sorted dictionary keys

2    a
3    b
8    c
dtype: object

In [20]:
pd.Series({2:"a",3:"b",8:"c"},index=[3,2])

3    b
2    a
dtype: object

# Pandas DataFrame Object

In [21]:
bts_age=pd.Series({"jin":30,'suga':29,'jhope':28,'rm':28,'jimin':27,'v':27,'jk':25})
bts_N=pd.Series({"jin":2,'suga':3,'jhope':4,'rm':1,'jimin':5,'v':6,'jk':7})
bts=pd.DataFrame({"Age":bts_age,"Number":bts_N})
bts

       Age  Number
jin     30       2
suga    29       3
jhope   28       4
rm      28       1
jimin   27       5
v       27       6
jk      25       7

In [22]:
print(type(bts_age))
print(type(bts_N))
type(bts)

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

pandas.core.frame.DataFrame

In [23]:
bts.index

Index(['jin', 'suga', 'jhope', 'rm', 'jimin', 'v', 'jk'], dtype='object')

In [24]:
bts.columns

Index(['Age', 'Number'], dtype='object')

In [25]:
bts['Number']

jin      2
suga     3
jhope    4
rm       1
jimin    5
v        6
jk       7
Name: Number, dtype: int64

In [26]:
bts['Age']

jin      30
suga     29
jhope    28
rm       28
jimin    27
v        27
jk       25
Name: Age, dtype: int64

Constructing DataFrame objects

In [27]:
#from a single series object.
pd.DataFrame(bts,columns=['Age'])

       Age
jin     30
suga    29
jhope   28
rm      28
jimin   27
v       27
jk      25

In [28]:
#from list of dicts
data=[{"a":i,"b":2*i} for i in range(5)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4
3  3  6
4  4  8

In [29]:
type(data)

list

In [30]:
x=pd.DataFrame([{'a':1,"b":3,"c":5},{"b":2,"d":8}])
x

     a  b    c    d
0  1.0  3  5.0  NaN
1  NaN  2  NaN  8.0

In [31]:
type(x)

pandas.core.frame.DataFrame

In [32]:
#from a dictionary of series objects
pd.DataFrame({'Age':bts_age,'Number':bts_N})

       Age  Number
jin     30       2
suga    29       3
jhope   28       4
rm      28       1
jimin   27       5
v       27       6
jk      25       7

In [33]:
#from two dimensional Numpy array
pd.DataFrame(np.random.rand(3,2),columns=['bar','cafe'],index=['a','b','c'])

        bar      cafe
a  0.352571  0.467470
b  0.944935  0.587046
c  0.309205  0.450047

# The pandas index object

In [34]:
ind=pd.Index([2,5,3,5,8,9])
ind

Int64Index([2, 5, 3, 5, 8, 9], dtype='int64')

#Index as immutable array

In [35]:
ind[1]

5

In [36]:
ind[::2]

Int64Index([2, 3, 8], dtype='int64')

In [37]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

6 (6,) 1 int64

In [38]:
ind[1]=0

TypeError: Index does not support mutable operations

#Index as oredered set

In [ ]:
a=pd.Index([1,2,3,4,8,9,7])
b=pd.Index([2,5,8,9,4,6,7])

In [ ]:
 a & b #intersection

In [ ]:
a | b #union

# Data Indexing and Selection

In [ ]:
# Data selection in Series

In [ ]:
data=pd.Series([0.25,0.5,0.75,1],index=['a','b','c','d'])
data

In [39]:
data['b']

TypeError: list indices must be integers or slices, not str

In [40]:
data[2]

{'a': 2, 'b': 4}

In [41]:
'a' in data

False

In [42]:
data.keys()

AttributeError: 'list' object has no attribute 'keys'

In [43]:
list(data.items())

AttributeError: 'list' object has no attribute 'items'

In [44]:
data['e']=1.25
data

TypeError: list indices must be integers or slices, not str

In [45]:
#slicing by explicit index
data['a':'c']

TypeError: slice indices must be integers or None or have an __index__ method

In [46]:
#slicing by implicit integer index
data[0:2]

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}]

In [47]:
#masking
print(data)
data[data<1]

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}, {'a': 3, 'b': 6}, {'a': 4, 'b': 8}]

TypeError: '<' not supported between instances of 'list' and 'int'

In [48]:
data[(data<0.75)&(data>0.25)]

TypeError: '<' not supported between instances of 'list' and 'float'

In [49]:
#fancy indexing
data[["a",'e']]

TypeError: list indices must be integers or slices, not list

# Indexers: loc,iloc and ix

In [50]:
data=pd.Series(["jin","rm","suga","jhope"],index=[1,4,2,3])
data

1      jin
4       rm
2     suga
3    jhope
dtype: object

In [51]:
#explicit index when indexing
data[1]

'jin'

In [52]:
#implicit index when slicing
data[1:3]

4      rm
2    suga
dtype: object

    Because of this potential confusion in the case of integer indexes, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes. These are not functional methods, but attributes that expose a particular slicing interface to the data in the series.
    First, the loc attribute allow indexing and slicing that always references the explicit index

In [53]:
data

1      jin
4       rm
2     suga
3    jhope
dtype: object

In [54]:
data.loc[1]

'jin'

In [55]:
data.loc[1:3]

1      jin
4       rm
2     suga
3    jhope
dtype: object

In [56]:
data.loc[1:2]

1     jin
4      rm
2    suga
dtype: object

The iloc attribute allows indexing and slicing that always references the implicit python-style index

In [57]:
data.iloc[1]

'rm'

In [58]:
data.iloc[1:2]

4    rm
dtype: object

In [59]:
data.iloc[1:3]

4      rm
2    suga
dtype: object

# Data Selection in DataFrame

In [60]:
bts

       Age  Number
jin     30       2
suga    29       3
jhope   28       4
rm      28       1
jimin   27       5
v       27       6
jk      25       7

In [61]:
bts['Age']

jin      30
suga     29
jhope    28
rm       28
jimin    27
v        27
jk       25
Name: Age, dtype: int64

In [62]:
bts.Number

jin      2
suga     3
jhope    4
rm       1
jimin    5
v        6
jk       7
Name: Number, dtype: int64

In [63]:
bts.Age is bts['Age']

True

In [64]:
bts['sarang']=bts['Age']*bts['Number']

In [65]:
bts

       Age  Number  sarang
jin     30       2      60
suga    29       3      87
jhope   28       4     112
rm      28       1      28
jimin   27       5     135
v       27       6     162
jk      25       7     175

In [66]:
bts.values

array([[ 30,   2,  60],
       [ 29,   3,  87],
       [ 28,   4, 112],
       [ 28,   1,  28],
       [ 27,   5, 135],
       [ 27,   6, 162],
       [ 25,   7, 175]], dtype=int64)

In [67]:
bts.T # Transpose of table/dataframe

        jin  suga  jhope  rm  jimin    v   jk
Age      30    29     28  28     27   27   25
Number    2     3      4   1      5    6    7
sarang   60    87    112  28    135  162  175

In [68]:
bts.values[0]

array([30,  2, 60], dtype=int64)

In [69]:
bts.index[0]

'jin'

In [70]:
bts

       Age  Number  sarang
jin     30       2      60
suga    29       3      87
jhope   28       4     112
rm      28       1      28
jimin   27       5     135
v       27       6     162
jk      25       7     175

In [71]:
bts.iloc[:3,:2]

       Age  Number
jin     30       2
suga    29       3
jhope   28       4

In [72]:
bts.loc[:'rm',:'Number']

       Age  Number
jin     30       2
suga    29       3
jhope   28       4
rm      28       1

In [73]:
bts.loc[bts.sarang>75,['sarang','Age']]

       sarang  Age
suga       87   29
jhope     112   28
jimin     135   27
v         162   27
jk        175   25

In [74]:
bts.iloc[5,2]=90
bts

       Age  Number  sarang
jin     30       2      60
suga    29       3      87
jhope   28       4     112
rm      28       1      28
jimin   27       5     135
v       27       6      90
jk      25       7     175

In [75]:
bts.loc[['rm','v'],'Age']

rm    28
v     27
Name: Age, dtype: int64

In [76]:
bts[1:3]

       Age  Number  sarang
suga    29       3      87
jhope   28       4     112

# Oprating on Data in Pandas

In [77]:
import pandas as pd
import numpy as np

In [78]:
rng=np.random.RandomState(42)
ser=pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [79]:
df=pd.DataFrame(rng.randint(0,10,(3,4)),columns=['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

   if we apply a NumPy ufunc on either of these objects, the result will be another Pandas object with the indices preserved.

In [80]:
np.exp(df)

             A            B           C            D
0   403.428793  8103.083928    7.389056   403.428793
1  1096.633158    54.598150   20.085537  1096.633158
2  1096.633158     7.389056  148.413159    54.598150

In [81]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [82]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

UFuncs: Index Aligment

In [83]:
area=pd.Series({"Aleska":4782145,"Texas":455184,"Busan":484154,"Seoul":454845,"Phaltan":45511,"Satara":265623},name="Area")
population=pd.Series({"Phaltan":445151411,"Busan":451514151,"Texas":4112112512,"Seoul":51151651151,"Aleska":15510212211,"Los Vegas":55165412215},name="Population")
population/area

Aleska         3243.358830
Busan           932.583746
Los Vegas              NaN
Phaltan        9781.182813
Satara                 NaN
Seoul        112459.521707
Texas          9033.956624
dtype: float64

In [84]:
area.index

Index(['Aleska', 'Texas', 'Busan', 'Seoul', 'Phaltan', 'Satara'], dtype='object')

In [85]:
area.index|population.index

C:\Users\pcc\AppData\Local\Temp/ipykernel_9640/3737809038.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  area.index|population.index

Index(['Aleska', 'Busan', 'Los Vegas', 'Phaltan', 'Satara', 'Seoul', 'Texas'], dtype='object')

In [86]:
A=pd.Series([2,5,8],index=[0,1,2])
B=pd.Series([3,7,9],index=[1,2,3])
A+B

0     NaN
1     8.0
2    15.0
3     NaN
dtype: float64

In [87]:
A.add(B,fill_value=0)

0     2.0
1     8.0
2    15.0
3     9.0
dtype: float64

In [88]:
A=pd.DataFrame(rng.randint(0,20,(3,3)),columns=["a","b","c"])
B=pd.DataFrame(rng.randint(0,10,(2,2)),columns=list("ba"))
print(A),print(B)

    a   b   c
0   1  11   5
1   1   0  11
2  11  16   9
   b  a
0  2  6
1  3  8

(None, None)

In [89]:
A+B

     a     b   c
0  7.0  13.0 NaN
1  9.0   3.0 NaN
2  NaN   NaN NaN

In [90]:
fill=A.stack().mean()
fill

7.222222222222222

In [91]:
fill=A.stack().median()
fill

9.0

In [92]:
fill=A.stack().mode()
fill

0    11
dtype: int32

In [93]:
A.add(B,fill_value=fill)

      a     b     c
0   7.0  13.0  16.0
1   9.0   3.0  22.0
2  22.0  27.0  20.0

Ufuncs:Operations between DataFrame and Series

In [94]:
A=rng.randint(0,10,size=(3,4))
print(A)
df=pd.DataFrame(A,columns=list('QRST'))
df

[[2 4 2 6]
 [4 8 6 1]
 [3 8 1 9]]

   Q  R  S  T
0  2  4  2  6
1  4  8  6  1
2  3  8  1  9

In [95]:
df-df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  2  4  4 -5
2  1  4 -1  3

In [96]:
df-df.iloc[1]

   Q  R  S  T
0 -2 -4 -4  5
1  0  0  0  0
2 -1  0 -5  8

In [97]:
df.subtract(df['R'],axis=0) #axis=0 row wise

   Q  R  S  T
0 -2  0 -2  2
1 -4  0 -2 -7
2 -5  0 -7  1

In [98]:
df

   Q  R  S  T
0  2  4  2  6
1  4  8  6  1
2  3  8  1  9

In [99]:
halfrow=df.iloc[0,::2]
halfrow

Q    2
S    2
Name: 0, dtype: int32

In [100]:
df-halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  2.0 NaN  4.0 NaN
2  1.0 NaN -1.0 NaN

# Handaling Missing Data

None pythonic missing data

In [101]:
val1=np.array([1,None,2,5])
print(val1)
print(val1.sum())

[1 None 2 5]

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

NaN: Missing Numerical Data

In [102]:
val2=np.array([1,2,np.nan,3])
print(val2)
print(val2.dtype)
print(1+np.nan)
print(0*np.nan)
val2.sum(),val2.min(),val2.max()

[ 1.  2. nan  3.]
float64
nan
nan

(nan, nan, nan)

In [103]:
#numpy does provide some special aggregations that will ignor these missing values:
np.nansum(val2),np.nanmin(val2),np.nanmax(val2)

(6.0, 1.0, 3.0)

Keep in the mind that NaN is specifically a floating-point value; there is no eqivalent NaN value for integers, strings, or other types

NaN and None in Pandas

In [104]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [105]:
x=pd.Series(range(2),dtype=int)
x

0    0
1    1
dtype: int32

In [106]:
x[0]

0

# Operating on Null Values

   As we have seen, Pandas treats None and NaN as essentially interchangeable for indicating missing or null values. To faciliate this convention, there are several useful methods for detecting, removing, and replacing null values in Pandas data structures. They are:
   isnull() Generate a Boolean mask indicting missing values
   notnull() Opposite of isnull()
   dropna() Return a filtered version of the data
   fillna() Return a copy of the data with missing values filled or imputed.

In [107]:
#Detecting null values
data=pd.Series([1,np.nan,"hello",None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [108]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [109]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [110]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [111]:
data[data.isnull()]

1     NaN
3    None
dtype: object

# Dropping null values

In [112]:
data.dropna()

0        1
2    hello
dtype: object

In [113]:
df=pd.DataFrame([[1,np.nan,2],[2,3,5],[np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

We cannot drop a single values from a dataframe; we can only drop full rows or full columns.

In [114]:
df.dropna()

     0    1  2
1  2.0  3.0  5

We can drop NA values along a different axis; axis=1 drops all containing a null value

In [115]:
df.dropna(axis="columns")

   2
0  2
1  5
2  6

In [116]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [117]:
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [118]:
df.dropna(axis='columns',how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [119]:
df.dropna(axis='columns',how='any')

   2
0  2
1  5
2  6

In [120]:
df.dropna(axis=1,how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [121]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

For finer-grained control, the thresh parameter lets you specify a minimum number of non-null values for the row/column to be kept:

In [122]:
df.dropna(axis='rows',thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [123]:
df.dropna(axis='rows',thresh=2)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [124]:
df.dropna(axis='rows',thresh=4)

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

# Filling null values

In [125]:
df.fillna(0)

     0    1  2    3
0  1.0  0.0  2  0.0
1  2.0  3.0  5  0.0
2  0.0  4.0  6  0.0

In [126]:
df.fillna(5)

     0    1  2    3
0  1.0  5.0  2  5.0
1  2.0  3.0  5  5.0
2  5.0  4.0  6  5.0

We can specify a forward-fill to propagate the previous value forward:

In [127]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [128]:
#forwor-fill
df.fillna(method='ffill')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

We can specify a back-fill to propagate the previous value backward:

In [129]:
#back-fill
df.fillna(method="bfill")

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [130]:
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [131]:
df.fillna(method='bfill',axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

# Combining Datasets: concat and Append

In [132]:
kl

NameError: name 'kl' is not defined

In [133]:
import pandas as pd
import numpy as np

In [134]:
def make_df(cols,ind):
    data={c:[str(c)+str(i) for i in ind] for c in cols}
    return pd.DataFrame(data,ind)

In [135]:
make_df("ABC",range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [136]:
x=[1,2,3]
y=[4,5,6]
z=[7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [137]:
x=[[1,2],[3,5]]
np.concatenate([x,x],axis=0)

array([[1, 2],
       [3, 5],
       [1, 2],
       [3, 5]])

Simple Concatenation with pd.conc

Pandas has a function, pd.concat(), which has a similar syntax to np.concatenate but contains a number of options that we'll discuss momentarily:

pd.concat(objs,axis=0,join='outer',join_axes=None,ignore_index=False,keys=None,levels=None,names=None,verify_integrity=False,copy=True)

In [138]:
A=pd.Series(["A","B","C"],index=[1,2,3])
B=pd.Series(["D","E","F"],index=[4,5,6])
pd.concat([A,B])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [139]:
df1=make_df("AB",[1,2])
df2=make_df("AB",[3,4])
print(df1),print(df2)
print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [140]:
df3=make_df("AB",[0,1])
df4=make_df("CD",[0,1])
print(df3),print(df4)
print(pd.concat([df3,df4],axis='columns')) #axis=1

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

# Duplicate Indices

One important difference between np.concatenate and pd.concat is that Pandas concatenation preserves indices, even if the result will have duplicate indices!

In [141]:
x=pd.Series([1,2])
x

0    1
1    2
dtype: int64

In [142]:
y=pd.Series([2,3])
y

0    2
1    3
dtype: int64

In [143]:
pd.concat([x,y])

0    1
1    2
0    2
1    3
dtype: int64

In [144]:
y.index=x.index #make duplicate indices!

# Catching the repeats as an error

If you'd like to simply verify that the indices in the result of pd.concat() do not overlap, you can specify the verify_integrity flag

In [145]:
pd.concat([x,y],verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

Ignoring the index

In [146]:
pd.concat([x,y],ignore_index=True)

0    1
1    2
2    2
3    3
dtype: int64

# Adding MultiIndex Keys:

In [147]:
pd.concat([x,y],keys=["x",'y'])

x  0    1
   1    2
y  0    2
   1    3
dtype: int64

In [148]:
df5=make_df('ABC',[1,2])
df6=make_df("BCD",[3,4])
print(df5)
print(df6)
pd.concat([df5,df6])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [149]:
pd.concat([df5,df6],join='inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [150]:
pd.concat([df5,df6],join='outer')

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [151]:
print(pd.concat([df5,df6],join_axes=[df5.columns]))  #join_axes is in updated version

TypeError: concat() got an unexpected keyword argument 'join_axes'

# The append() method

In [152]:
print(df1),print(df2)
print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

keep in mind that unlike the append() and extend() methods of python lists, the append() method in pandas does not modify the original object-instead, it creates a new object with the combined data.

# Combining Datasets: Merge and join
#one-to-one joins

In [153]:
df1=pd.DataFrame({'name':['jin','suga','jhope','rm','jimin','v','jk'],'role':['singer','rapper','rapper','rapper',"singer",'singer','singer']})
df2=pd.DataFrame({'name':['jin','suga','jhope','rm','jimin','v','jk'],'age':[30,29,28,28,27,27,25]})
print(df1)
df2

    name    role
0    jin  singer
1   suga  rapper
2  jhope  rapper
3     rm  rapper
4  jimin  singer
5      v  singer
6     jk  singer

    name  age
0    jin   30
1   suga   29
2  jhope   28
3     rm   28
4  jimin   27
5      v   27
6     jk   25

In [154]:
df3=pd.merge(df1,df2)
df3

    name    role  age
0    jin  singer   30
1   suga  rapper   29
2  jhope  rapper   28
3     rm  rapper   28
4  jimin  singer   27
5      v  singer   27
6     jk  singer   25

# Many-to-one joins

In [155]:
df5

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [156]:
df5=pd.DataFrame({'role':['singer',"rapper","rapper","rapper",'singer',"singer","singer"],"skill":["cute","allrounder","brain","dance","music","model","cooking"]})
print(df1),print(df5),
print(pd.merge(df,df5,left_on="name",right_on="role"))

    name    role
0    jin  singer
1   suga  rapper
2  jhope  rapper
3     rm  rapper
4  jimin  singer
5      v  singer
6     jk  singer
     role       skill
0  singer        cute
1  rapper  allrounder
2  rapper       brain
3  rapper       dance
4  singer       music
5  singer       model
6  singer     cooking

KeyError: 'name'

In [157]:
a=pd.DataFrame({'group':["Acc","Acc","Eng","Eng","HR","HR"],"skill":["M","S","C","L","S","O"]})
print(a)
a1=pd.DataFrame({"employee":["Bob","Jake","Lisa","Sue"],"group":["Acc","Eng","Eng","HR"]})
print(a1)

  group skill
0   Acc     M
1   Acc     S
2   Eng     C
3   Eng     L
4    HR     S
5    HR     O
  employee group
0      Bob   Acc
1     Jake   Eng
2     Lisa   Eng
3      Sue    HR

In [158]:
pd.merge(a,a1)

  group skill employee
0   Acc     M      Bob
1   Acc     S      Bob
2   Eng     C     Jake
3   Eng     C     Lisa
4   Eng     L     Jake
5   Eng     L     Lisa
6    HR     S      Sue
7    HR     O      Sue

# Specification of the merge key

In [159]:
df1

    name    role
0    jin  singer
1   suga  rapper
2  jhope  rapper
3     rm  rapper
4  jimin  singer
5      v  singer
6     jk  singer

In [160]:
df2

    name  age
0    jin   30
1   suga   29
2  jhope   28
3     rm   28
4  jimin   27
5      v   27
6     jk   25

In [161]:
pd.merge(df1,df2,on="name")

    name    role  age
0    jin  singer   30
1   suga  rapper   29
2  jhope  rapper   28
3     rm  rapper   28
4  jimin  singer   27
5      v  singer   27
6     jk  singer   25

In [162]:
#The left_on and right_on keywords
a2=pd.DataFrame({"name":["Bob","Jake","Lisa","Sue"],"salary":[70000,800000,500000,60000000]})
print(a),print(a1),print(a2)
print(pd.merge(a1,a2,left_on="employee",right_on="name"))

  group skill
0   Acc     M
1   Acc     S
2   Eng     C
3   Eng     L
4    HR     S
5    HR     O
  employee group
0      Bob   Acc
1     Jake   Eng
2     Lisa   Eng
3      Sue    HR
   name    salary
0   Bob     70000
1  Jake    800000
2  Lisa    500000
3   Sue  60000000
  employee group  name    salary
0      Bob   Acc   Bob     70000
1     Jake   Eng  Jake    800000
2     Lisa   Eng  Lisa    500000
3      Sue    HR   Sue  60000000

In [163]:
print(pd.merge(a1,a2,left_on="employee",right_on="name").drop("name",axis=1))

  employee group    salary
0      Bob   Acc     70000
1     Jake   Eng    800000
2     Lisa   Eng    500000
3      Sue    HR  60000000

In [164]:
a3=pd.DataFrame({"employee":["Bob","Jake","Lisa","Sue"],"salary":[70000,800000,500000,60000000]})

In [165]:
#left_index and right_index keywords
#sometimes, rather than merging on a column, you would instead like to merge on an index.
a1a=a1.set_index("employee")
a2a=a3.set_index("employee")
print(a1a)
print(a2a)
print(pd.merge(a1a,a2a,left_index=True,right_index=True))

         group
employee
Bob        Acc
Jake       Eng
Lisa       Eng
Sue         HR
            salary
employee
Bob          70000
Jake        800000
Lisa        500000
Sue       60000000
         group    salary
employee
Bob        Acc     70000
Jake       Eng    800000
Lisa       Eng    500000
Sue         HR  60000000

In [166]:
a1a.join(a2a)

         group    salary
employee
Bob        Acc     70000
Jake       Eng    800000
Lisa       Eng    500000
Sue         HR  60000000

In [167]:
a2

   name    salary
0   Bob     70000
1  Jake    800000
2  Lisa    500000
3   Sue  60000000

In [168]:
pd.merge(a1a,a2,left_index=True,right_on="name")

  group  name    salary
0   Acc   Bob     70000
1   Eng  Jake    800000
2   Eng  Lisa    500000
3    HR   Sue  60000000

# Specifying set arithmetic for joins

In [169]:
df6=pd.DataFrame({"name":["A","B"],"food":["N","P"]},columns=["name","food"])
df7=pd.DataFrame({"name":["A","B","Z"],"drink":["C","T","J"]},columns=["name","drink"])
print(df6)
print(df7)
pd.merge(df6,df7)

  name food
0    A    N
1    B    P
  name drink
0    A     C
1    B     T
2    Z     J

  name food drink
0    A    N     C
1    B    P     T

In [170]:
pd.merge(df6,df7,how="inner")

  name food drink
0    A    N     C
1    B    P     T

In [171]:
pd.merge(df6,df7,how="outer")

  name food drink
0    A    N     C
1    B    P     T
2    Z  NaN     J

In [172]:
pd.merge(df6,df7,how="left")

  name food drink
0    A    N     C
1    B    P     T

In [173]:
pd.merge(df6,df7,how="right")

  name food drink
0    A    N     C
1    B    P     T
2    Z  NaN     J

# Overlapping column names: the suffixes keyword

In [174]:
df8=pd.DataFrame({"name":["A","B"],"food":["N","P"]},columns=["name","food"])
df9=pd.DataFrame({"name":["A","B"],"food":["C","T"]},columns=["name","food"])
print(df8)
print(df9)
pd.merge(df8,df9,on="name")

  name food
0    A    N
1    B    P
  name food
0    A    C
1    B    T

  name food_x food_y
0    A      N      C
1    B      P      T

In [175]:
pd.merge(df8,df9,on="name",suffixes=["_lo","_Ro"])

  name food_lo food_Ro
0    A       N       C
1    B       P       T

In [176]:
df=pd.read_csv("E:/MSC project/Carbon Footprint dataset.csv")
df

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
0,0,0,0,1,0.90
1,1,1,1,1,2.84
2,2,2,2,1,4.51
3,3,3,3,1,0.26
4,4,4,4,1,3.32
...,...,...,...,...,...
98,98,98,98,4,3.94
99,99,99,99,1,0.32
100,100,100,100,1,0.94
101,101,101,101,2,1.45
102,102,102,102,1,0.61

In [177]:
filepath="E:/MSC project/Carbon Footprint dataset.csv"
df=pd.read_csv(filepath)
df

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
0,0,0,0,1,0.90
1,1,1,1,1,2.84
2,2,2,2,1,4.51
3,3,3,3,1,0.26
4,4,4,4,1,3.32
...,...,...,...,...,...
98,98,98,98,4,3.94
99,99,99,99,1,0.32
100,100,100,100,1,0.94
101,101,101,101,2,1.45
102,102,102,102,1,0.61

In [178]:
type(df)

pandas.core.frame.DataFrame

In [179]:
df.head()

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
0,0,0,0,1,0.90
1,1,1,1,1,2.84
2,2,2,2,1,4.51
3,3,3,3,1,0.26
4,4,4,4,1,3.32

In [180]:
df.head(10)

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
0,0,0,0,1,0.90
1,1,1,1,1,2.84
2,2,2,2,1,4.51
3,3,3,3,1,0.26
4,4,4,4,1,3.32
5,5,5,5,1,0.52
6,6,6,6,1,0.31
7,7,7,7,1,0.60
8,8,8,8,1,3.19
9,9,9,9,1,5.18

In [181]:
df.tail()

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
98,98,98,98,4,3.94
99,99,99,99,1,0.32
100,100,100,100,1,0.94
101,101,101,101,2,1.45
102,102,102,102,1,0.61

In [182]:
df.tail(10)

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
93,93,93,93,1,0.31
94,94,94,94,1,0.36
95,95,95,95,1,0.25
96,96,96,96,1,0.65
97,97,97,97,1,0.73
98,98,98,98,4,3.94
99,99,99,99,1,0.32
100,100,100,100,1,0.94
101,101,101,101,2,1.45
102,102,102,102,1,0.61

In [183]:
df.shape

(103, 5)

In [184]:
pd.read_csv(filepath,header=0)

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
0,0,0,0,1,0.90
1,1,1,1,1,2.84
2,2,2,2,1,4.51
3,3,3,3,1,0.26
4,4,4,4,1,3.32
...,...,...,...,...,...
98,98,98,98,4,3.94
99,99,99,99,1,0.32
100,100,100,100,1,0.94
101,101,101,101,2,1.45
102,102,102,102,1,0.61

In [185]:
pd.read_csv(filepath,header=[1,2])  #multi-indexing

       0            1   0.9
       1  1.1  1.2  1  2.84
0      2    2    2  1  4.51
1      3    3    3  1  0.26
2      4    4    4  1  3.32
3      5    5    5  1  0.52
4      6    6    6  1  0.31
..   ...  ...  ... ..   ...
96    98   98   98  4  3.94
97    99   99   99  1  0.32
98   100  100  100  1  0.94
99   101  101  101  2  1.45
100  102  102  102  1  0.61

[101 rows x 5 columns]

In [186]:
pd.read_csv(filepath,index_col="Carbon_Footprint")

                  Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1  Total_Expenditure
Carbon_Footprint
0.90                       0             0               0                  1
2.84                       1             1               1                  1
4.51                       2             2               2                  1
0.26                       3             3               3                  1
3.32                       4             4               4                  1
...                      ...           ...             ...                ...
3.94                      98            98              98                  4
0.32                      99            99              99                  1
0.94                     100           100             100                  1
1.45                     101           101             101                  2
0.61                     102           102             102                  1

[103 rows x 4 columns]

In [187]:
pd.read_csv(filepath,index_col="Total_Expenditure")

                   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1  Carbon_Footprint
Total_Expenditure
1                           0             0               0              0.90
1                           1             1               1              2.84
1                           2             2               2              4.51
1                           3             3               3              0.26
1                           4             4               4              3.32
...                       ...           ...             ...               ...
4                          98            98              98              3.94
1                          99            99              99              0.32
1                         100           100             100              0.94
2                         101           101             101              1.45
1                         102           102             102              0.61

[103 rows x 4 columns]

In [188]:
pd.read_csv(filepath,usecols=["Total_Expenditure"])

     Total_Expenditure
0                    1
1                    1
2                    1
3                    1
4                    1
..                 ...
98                   4
99                   1
100                  1
101                  2
102                  1

[103 rows x 1 columns]

In [189]:
#returns pandas series if there is only one column
pd.read_csv(filepath,usecols=["Total_Expenditure"],squeeze=True)

0      1
1      1
2      1
3      1
4      1
      ..
98     4
99     1
100    1
101    2
102    1
Name: Total_Expenditure, Length: 103, dtype: int64

In [190]:
pd.read_csv(filepath,skiprows=[1,2,4,6])

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Total_Expenditure,Carbon_Footprint
0,2,2,2,1,4.51
1,4,4,4,1,3.32
2,6,6,6,1,0.31
3,7,7,7,1,0.60
4,8,8,8,1,3.19
...,...,...,...,...,...
94,98,98,98,4,3.94
95,99,99,99,1,0.32
96,100,100,100,1,0.94
97,101,101,101,2,1.45
98,102,102,102,1,0.61

In [191]:
df.to_csv(filepath)

# Simple Aggregation in Pandas

In [192]:
rng=np.random.RandomState(40)
print(rng)
ser=pd.Series(rng.rand(6))
ser

RandomState(MT19937)

0    0.407687
1    0.055366
2    0.788535
3    0.287305
4    0.450351
5    0.303912
dtype: float64

In [193]:
ser.sum()

2.2931560227762815

In [194]:
ser.mean()

0.3821926704627136

In [195]:
df=pd.DataFrame({"A":rng.rand(5),"B":rng.rand(5)})
df

          A         B
0  0.526400  0.600816
1  0.623812  0.813969
2  0.776775  0.708645
3  0.686242  0.027535
4  0.980939  0.904267

In [196]:
df.mean()

A    0.718834
B    0.611046
dtype: float64

In [197]:
df.mean(axis='columns')

0    0.563608
1    0.718890
2    0.742710
3    0.356888
4    0.942603
dtype: float64

In [198]:
df.min()

A    0.526400
B    0.027535
dtype: float64

In [199]:
df.std()

A    0.172611
B    0.345424
dtype: float64

In [200]:
import seaborn as sns
planets=sns.load_dataset("planets")
planets.shape

(1035, 6)

In [201]:
p=sns.load_dataset('tips')

In [202]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [203]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [204]:
planets.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [205]:
planets.var()

C:\Users\pcc\AppData\Local\Temp/ipykernel_9640/716678270.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  planets.var()

number            1.540022e+00
orbital_period    6.767661e+08
mass              1.458183e+01
distance          5.374598e+05
year              1.578129e+01
dtype: float64

# Group By: Split, Apply, Combine

The split step involves breaking up and grouping a dataframe depending on the value of the specified key.
The appl step involves computing some function, usually an aggreagate, transformation, or filtering, within the individual groups.
The combine step merges the result of these operations into an output array.

In [206]:
df=pd.DataFrame({"Key":["A",'B','C','A','B','C'],'data':range(6)},columns=['Key','data'])

In [207]:
df

  Key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [208]:
df.groupby("Key")

In [209]:
df

  Key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [210]:
df.groupby("Key").sum()

     data
Key
A       3
B       5
C       7

In [211]:
df.groupby("Key").mean()

     data
Key
A     1.5
B     2.5
C     3.5

In [212]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [213]:
planets.groupby("method")

In [214]:
planets.groupby("method").sum()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,2,1.262360e+03,0.00000,35.75,4023
Eclipse Timing Variations,15,4.276480e+04,10.25000,1261.44,18090
Imaging,50,1.418973e+06,0.00000,2166.91,76347
Microlensing,27,2.207500e+04,0.00000,41440.00,46225
Orbital Brightness Modulation,5,2.127920e+00,0.00000,2360.00,6035
Pulsar Timing,11,3.671511e+04,0.00000,1200.00,9992
Pulsation Timing Variations,1,1.170000e+03,0.00000,0.00,2007
Radial Velocity,952,4.553151e+05,1341.65638,27348.11,1110158
Transit,776,8.377523e+03,1.47000,134242.77,798461
Transit Timing Variations,9,2.393505e+02,0.00000,3313.00,8050

In [215]:
planets.groupby("method")["orbital_period"]

In [216]:
planets.groupby("method").median()

                               number  orbital_period   mass  distance    year
method
Astrometry                        1.0      631.180000    NaN    17.875  2011.5
Eclipse Timing Variations         2.0     4343.500000  5.125   315.360  2010.0
Imaging                           1.0    27500.000000    NaN    40.395  2009.0
Microlensing                      1.0     3300.000000    NaN  3840.000  2010.0
Orbital Brightness Modulation     2.0        0.342887    NaN  1180.000  2011.0
Pulsar Timing                     3.0       66.541900    NaN  1200.000  1994.0
Pulsation Timing Variations       1.0     1170.000000    NaN       NaN  2007.0
Radial Velocity                   1.0      360.200000  1.260    40.445  2009.0
Transit                           1.0        5.714932  1.470   341.000  2012.0
Transit Timing Variations         2.0       57.011000    NaN   855.000  2012.5

In [217]:
planets.groupby("method")["orbital_period"].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

# Iteration over groups

In [218]:
for (method,group) in planets.groupby("method"):
    print("{0:50s} shape={1}".format(method,group.shape))

Astrometry                                         shape=(2, 6)
Eclipse Timing Variations                          shape=(9, 6)
Imaging                                            shape=(38, 6)
Microlensing                                       shape=(23, 6)
Orbital Brightness Modulation                      shape=(3, 6)
Pulsar Timing                                      shape=(5, 6)
Pulsation Timing Variations                        shape=(1, 6)
Radial Velocity                                    shape=(553, 6)
Transit                                            shape=(397, 6)
Transit Timing Variations                          shape=(4, 6)

In [219]:
planets.groupby("method")["distance"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

# Aggregate, filter, transform,apply

In [220]:
rng=np.random.RandomState(1)
df=pd.DataFrame({"key":["A",'B','C','A','B','C'],'data1':range(6),'data2':rng.randint(0,10,6)},columns=['key','data1','data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      8
2   C      2      9
3   A      3      5
4   B      4      0
5   C      5      0

Aggregation

Aggregate method can take a string, a function, or a list thereof, and compute all the aggregates at once.

In [221]:
df.groupby("key").aggregate(["min",np.median,max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     5    5.0   5
B       1    2.5   4     0    4.0   8
C       2    3.5   5     0    4.5   9

In [222]:
df.groupby("key").aggregate({'data1':"min","data2":"max"})

     data1  data2
key
A        0      5
B        1      8
C        2      9

In [223]:
df.groupby("key").aggregate({"data1":["min","max"],'data2':[np.median,"max"]})

    data1      data2
      min max median max
key
A       0   3    5.0   5
B       1   4    4.0   8
C       2   5    4.5   9

Filtering

A filtering operation allows you to drop data based on the group properties.

In [224]:
def filter_fun(x):
    return x['data2'].std()>4

print(df)
print(df.groupby("key").std())
print(df.groupby("key").filter(filter_fun))

  key  data1  data2
0   A      0      5
1   B      1      8
2   C      2      9
3   A      3      5
4   B      4      0
5   C      5      0
       data1     data2
key
A    2.12132  0.000000
B    2.12132  5.656854
C    2.12132  6.363961
  key  data1  data2
1   B      1      8
2   C      2      9
4   B      4      0
5   C      5      0

Transformation

In [225]:
df.groupby("key").transform(lambda x: x-x.mean())

   data1  data2
0   -1.5    0.0
1   -1.5    4.0
2   -1.5    4.5
3    1.5    0.0
4    1.5   -4.0
5    1.5   -4.5

The apply() method

The apply() method lets you apply an arbitary function to the group results. The function should take a Dataframe, and return either a pandas object(e.g. DataFrame,Series) or a sclar; the combine operation will be tailored to the type of output returned. For example, here is an apply() that normalizes the first column by the sum of the second.

In [226]:
def norm_by_data2(x):
    #x is a DataFrame of group values
    x['data1']/=x['data2'].sum()
    return x

In [227]:
print(df)

  key  data1  data2
0   A      0      5
1   B      1      8
2   C      2      9
3   A      3      5
4   B      4      0
5   C      5      0

In [228]:
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.125000      8
2   C  0.222222      9
3   A  0.300000      5
4   B  0.500000      0
5   C  0.555556      0

Specifying the spit key

In [229]:
l=[0,1,0,1,2,0]

In [230]:
print(df)

  key  data1  data2
0   A      0      5
1   B      1      8
2   C      2      9
3   A      3      5
4   B      4      0
5   C      5      0

In [231]:
print(df.groupby(l).sum())

   data1  data2
0      7     14
1      4     13
2      4      0

In [232]:
print(df.groupby(df['key']).sum())

     data1  data2
key
A        3     10
B        5      8
C        7      9

A dictionary or series mapping index to group

In [233]:
df2=df.set_index('key')
mapping={"A":"vowel","B":"consonant","C":"consonant"}
print(df2)
print(df2.groupby(mapping).sum())

     data1  data2
key
A        0      5
B        1      8
C        2      9
A        3      5
B        4      0
C        5      0
           data1  data2
key
consonant     12     17
vowel          3     10

Any python function

In [234]:
print(df2)

     data1  data2
key
A        0      5
B        1      8
C        2      9
A        3      5
B        4      0
C        5      0

In [235]:
print(df2.groupby(str.lower).mean())

     data1  data2
key
a      1.5    5.0
b      2.5    4.0
c      3.5    4.5

# A list of valid keys

In [236]:
df2.groupby([str.lower,mapping]).mean()

               data1  data2
key key
a   vowel        1.5    5.0
b   consonant    2.5    4.0
c   consonant    3.5    4.5

In [237]:
planets.head(5)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [238]:
decade=10*(planets["year"]//10)
decade

0       2000
1       2000
2       2010
3       2000
4       2000
        ...
1030    2000
1031    2000
1032    2000
1033    2000
1034    2000
Name: year, Length: 1035, dtype: int64

In [239]:
decade=decade.astype(str)+'s'

In [240]:
decade.name='decade'

In [241]:
planets.groupby(['method',decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [242]:
planets.groupby(["method",decade])['number'].sum()

method                         decade
Astrometry                     2010s       2
Eclipse Timing Variations      2000s       5
                               2010s      10
Imaging                        2000s      29
                               2010s      21
Microlensing                   2000s      12
                               2010s      15
Orbital Brightness Modulation  2010s       5
Pulsar Timing                  1990s       9
                               2000s       1
                               2010s       1
Pulsation Timing Variations    2000s       1
Radial Velocity                1980s       1
                               1990s      52
                               2000s     475
                               2010s     424
Transit                        2000s      64
                               2010s     712
Transit Timing Variations      2010s       9
Name: number, dtype: int64

In [243]:
planets.groupby(["method",decade])['number'].sum().unstack()

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       NaN    NaN    NaN    2.0
Eclipse Timing Variations        NaN    NaN    5.0   10.0
Imaging                          NaN    NaN   29.0   21.0
Microlensing                     NaN    NaN   12.0   15.0
Orbital Brightness Modulation    NaN    NaN    NaN    5.0
Pulsar Timing                    NaN    9.0    1.0    1.0
Pulsation Timing Variations      NaN    NaN    1.0    NaN
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          NaN    NaN   64.0  712.0
Transit Timing Variations        NaN    NaN    NaN    9.0

In [244]:
planets.groupby(["method",decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

# Pivot Table

In [245]:
import numpy as np
import pandas as pd
import seaborn as sns
p #tips data set

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [246]:
p.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Pivot by hand

In [247]:
p.groupby("sex")['tip'].mean()

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

In [248]:
p.groupby(['sex','time'])['total_bill'].aggregate("mean").unstack()

time        Lunch     Dinner
sex
Male    18.048485  21.461452
Female  16.339143  19.213077

# Pivot Table Syntax

In [249]:
p.pivot_table("total_bill",index="sex",columns="time")

time        Lunch     Dinner
sex
Male    18.048485  21.461452
Female  16.339143  19.213077

# Multilevel pivot tables

In [250]:
size=pd.cut(p['size'],[2,3,4])

In [251]:
p.pivot_table("total_bill",["sex",size],"time")

time               Lunch     Dinner
sex    size
Male   (2, 3]  20.765000  24.607273
       (3, 4]  23.865000  28.402308
Female (2, 3]  17.030000  22.779091
       (3, 4]  34.006667  28.415000

In [252]:
tip=pd.qcut(p['tip'],3)
tip

0      (0.999, 2.03]
1      (0.999, 2.03]
2       (3.25, 10.0]
3       (3.25, 10.0]
4       (3.25, 10.0]
           ...
239     (3.25, 10.0]
240    (0.999, 2.03]
241    (0.999, 2.03]
242    (0.999, 2.03]
243     (2.03, 3.25]
Name: tip, Length: 244, dtype: category
Categories (3, interval[float64, right]): [(0.999, 2.03] < (2.03, 3.25] < (3.25, 10.0]]

In [253]:
p.pivot_table("total_bill",["sex",size],[tip,"time"])

tip           (0.999, 2.03]            (2.03, 3.25]            (3.25, 10.0]  \
time                  Lunch     Dinner        Lunch     Dinner        Lunch
sex    size
Male   (2, 3]           NaN  18.903333       22.820  19.128571       18.710
       (3, 4]           NaN  21.205000          NaN  25.522857       23.865
Female (2, 3]         18.64  13.270000       16.225  26.100000          NaN
       (3, 4]           NaN        NaN       24.080  25.415000       38.970

tip
time              Dinner
sex    size
Male   (2, 3]  29.229167
       (3, 4]  31.665333
Female (2, 3]  24.288333
       (3, 4]  29.915000

# Additional pivot table options

DataFrame.pivot_table(data,values=None,index=None,columns=None,aggfunc='mean',fill_value=None,margins=False,dropna=True,margins_name='All')

In [254]:
p.pivot_table('total_bill',index='sex',columns='time',aggfunc='mean')

time        Lunch     Dinner
sex
Male    18.048485  21.461452
Female  16.339143  19.213077

In [255]:
p.pivot_table('total_bill',index='sex',columns='time',aggfunc='sum')

time     Lunch   Dinner
sex
Male    595.60  2661.22
Female  571.87   999.08

In [256]:
p.pivot_table('total_bill',index='sex',columns='time',aggfunc='median')

time    Lunch  Dinner
sex
Male    16.58   19.63
Female  13.42   17.19

In [257]:
p.pivot_table(index='sex',columns='time',aggfunc={"tip":"mean","total_bill":sum})

             tip           total_bill
time       Lunch    Dinner      Lunch   Dinner
sex
Male    2.882121  3.144839     595.60  2661.22
Female  2.582857  3.002115     571.87   999.08

In [258]:
p.pivot_table('total_bill',index='sex',columns='time',aggfunc='mean',margins=True)

time        Lunch     Dinner        All
sex
Male    18.048485  21.461452  20.744076
Female  16.339143  19.213077  18.056897
All     17.168676  20.797159  19.785943

# Vectorized String Operations

In [259]:
x=np.array([2,11,55,78,95,85])
x*2

array([  4,  22, 110, 156, 190, 170])

In [260]:
data=["Jin","JiMin","JangKOOK","jhope"]
data

['Jin', 'JiMin', 'JangKOOK', 'jhope']

In [261]:
[s.capitalize() for s in data]

['Jin', 'Jimin', 'Jangkook', 'Jhope']

In [262]:
data=["Jin","JiMin",None,"JangKOOK","jhope"]
data

['Jin', 'JiMin', None, 'JangKOOK', 'jhope']

In [263]:
[s.capitalize() for s in data]

AttributeError: 'NoneType' object has no attribute 'capitalize'

In [264]:
names=pd.Series(data)
names

0         Jin
1       JiMin
2        None
3    JangKOOK
4       jhope
dtype: object

In [265]:
names.str.capitalize()

0         Jin
1       Jimin
2        None
3    Jangkook
4       Jhope
dtype: object

In [266]:
names.str.upper()

0         JIN
1       JIMIN
2        None
3    JANGKOOK
4       JHOPE
dtype: object

In [267]:
names.str.lower()

0         jin
1       jimin
2        None
3    jangkook
4       jhope
dtype: object

In [268]:
names.str.len()

0    3.0
1    5.0
2    NaN
3    8.0
4    5.0
dtype: float64

In [269]:
names.str.startswith("j")

0    False
1    False
2     None
3    False
4     True
dtype: object

In [270]:
names.str.split()

0         [Jin]
1       [JiMin]
2          None
3    [JangKOOK]
4       [jhope]
dtype: object